hartmann_number_testing/hunt/epotFoam_Ha_1000/system/cutPlaneSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out cut-plane surface files with interpolated field data in VTK
    format.

\*---------------------------------------------------------------------------*/

point       (13 0 0);
normal      (1 0 0);

fields      (Ux);

interpolate true; // If false, write cell data to the surface triangles.
                  // If true, write interpolated data at the surface points.

#includeEtc "caseDicts/postProcessing/surface/cutPlaneSurface.cfg"

// ************************************************************************* //
